y1s1/cy1601-math-1/module-1b/tutorial.tex
% Created 2023-08-29 Tue 01:52
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Hankertrix}
\date{\today}
\title{Math Module 1B Tutorial}
\hypersetup{
 pdfauthor={Hankertrix},
 pdftitle={Math Module 1B Tutorial},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.1 (Org mode 9.6.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{2}
\tableofcontents

\newpage

\section{Question 1}
\label{sec:org2349999}

\subsection{(a)}
\label{sec:orgf900a1f}

\begin{align*}
\frac{x^3 + 8}{x + 2} &= \frac{(x + 2)(x^2 - 2x + 4)}{x + 2} \\
&= x^2 - 2x + 4
\end{align*}

Hence:
\begin{align*}
\lim_{x \rightarrow -2} \frac{x^3 + 8}{x + 2} &= \lim_{x \rightarrow -2} x^2 - 2x + 4 \\
&= (-2)^2 - 2(-2) + 4 \\
&= 12
\end{align*}

\subsection{(b)}
\label{sec:orge572c3d}

\begin{align*}
\frac{\sqrt{x} - \sqrt{4 - x}}{x - 2} &= \frac{\sqrt{x} - \sqrt{4 - x}}{x - 2} \left(\frac{\sqrt{x} + \sqrt{4 - x}}{\sqrt{x} + \sqrt{4 - x}}\right) \\
&= \frac{x - (4 - x)}{(x - 2)(\sqrt{x} + \sqrt{4 - x})} \\
&= \frac{2x - 4}{(x - 2)(\sqrt{x} + \sqrt{4 - x})} \\
&= \frac{2(x - 2)}{(x - 2)(\sqrt{x} + \sqrt{4 - x})} \\
&= \frac{2}{\sqrt{x} + \sqrt{4 - x}} \\
\end{align*}

Hence:
\begin{align*}
\lim_{x \rightarrow 2} \frac{\sqrt{x} - \sqrt{4 - x}}{x - 2} &= \lim_{x \rightarrow 2} \frac{2}{\sqrt{x} + \sqrt{4 - x}} \\
&= \frac{2}{\sqrt{2} + \sqrt{4 - 2}} \\
&= \frac{2}{2 \sqrt{2}} \\
&= \frac{1}{\sqrt{2}}
\end{align*}

\subsection{(c)}
\label{sec:orgf98a100}

\begin{align*}
\frac{\sqrt[3]{1 + \sin x} - 1}{x} &= \frac{\sqrt[3]{1 + \sin x} - 1}{x} \left( \frac{(\sqrt[3]{1 + \sin x})^2 + \sqrt[3]{1 + \sin x} + 1}{(\sqrt[3]{1 + \sin x})^2 + \sqrt[3]{1 + \sin x} + 1} \right) \\
&= \frac{1 + \sin x - 1}{x((\sqrt[3]{1 + \sin x})^2 + \sqrt[3]{1 + \sin x} + 1)} \\
&= \frac{\sin x}{x((\sqrt[3]{1 + \sin x})^2 + \sqrt[3]{1 + \sin x} + 1)} \\
&= \frac{\sin x}{x} \left(\frac{1}{(\sqrt[3]{1 + \sin x})^2 + \sqrt[3]{1 + \sin x} + 1} \right)
\end{align*}

Hence:
\begin{align*}
\lim_{x \rightarrow 0} \frac{\sqrt[3]{1 + \sin x} - 1}{x} &= \lim_{x \rightarrow 0} \frac{\sin x}{x} \left(\frac{1}{(\sqrt[3]{1 + \sin x})^2 + \sqrt[3]{1 + \sin x} + 1} \right) \\
&= \lim_{x \rightarrow 0} \frac{\sin x}{x} \cdot \lim_{x \rightarrow 0} \frac{1}{(\sqrt[3]{1 + \sin x})^2 + \sqrt[3]{1 + \sin x} + 1} \\
&= 1 \cdot \frac{1}{(\sqrt[3]{1 + \sin 0})^2 + \sqrt[3]{1 + \sin 0} + 1} \\
&= 1 \cdot \frac{1}{(\sqrt[3]{1})^2 + \sqrt[3]{1} + 1} \\
&= 1 \cdot \frac{1}{1^2 + 1 + 1} \\
&= 1 \cdot \frac{1}{1 + 1 + 1} \\
&= 1 \cdot \frac{1}{3} \\
&= \frac{1}{3}
\end{align*}

\subsection{(d)}
\label{sec:orgbdcac06}

Using L'H\(\text{\^o}\)pital's rule:
\begin{align*}
\lim_{x \rightarrow 0} \frac{\sin 4x}{\sin 6x} &= \lim_{x \rightarrow 0} \frac{d \sin 4x}{dx} \left( \frac{d \sin 6x}{dx} \right)^{-1} \\
&= \lim_{x \rightarrow 0} (4 \cos 4x)(6 \cos 6x)^{-1} \\
&= \lim_{x \rightarrow 0} \frac{4 \cos 4x}{6 \cos 6x} \\
&= \frac{4 \cos 4(0)}{6 \cos 6(0)} \\
&= \frac{4}{6} \\
&= \frac{2}{3}
\end{align*}

Without using L'H\(\text{\^o}\)pital's rule:
\begin{align*}
\frac{\sin 4x}{\sin 6x} &= \frac{4x \sin 4x}{4x} \cdot \left( \frac{6x \sin 6x}{6x} \right)^{-1} \\
&= 4x \left( \frac{\sin 4x}{4x} \right) \cdot \frac{1}{6x} \left( \frac{\sin 6x}{6x} \right)^{-1} \\
&= \frac{4x}{6x} \left( \frac{\sin 4x}{4x} \right) \left( \frac{\sin 6x}{6x} \right)^{-1} \\
&= \frac{4}{6} \left( \frac{\sin 4x}{4x} \right) \left( \frac{\sin 6x}{6x} \right)^{-1} \\
\end{align*}

Hence:
\begin{align*}
\lim_{x \rightarrow x} \frac{\sin 4x}{\sin 6x} &= \lim_{x \rightarrow 0} \frac{4}{6} \left( \frac{\sin 4x}{4x} \right) \left( \frac{\sin 6x}{6x} \right)^{-1} \\
&= \frac{4}{6}(1)(1)^{-1} \\
&= \frac{4}{6}(1)(1) \\
&= \frac{2}{3}
\end{align*}

\subsection{(e)}
\label{sec:orgeef30f9}

\begin{align*}
\frac{\sin^3 2x}{x^3} &= \frac{1}{x^3} \left(\frac{2x \sin 2x}{2x} \right) \left(\frac{2x \sin 2x}{2x} \right) \left(\frac{2x \sin 2x}{2x} \right) \\
&= \frac{8x^3}{x^3} \left( \frac{\sin 2x}{2x} \right)^3 \\
&= 8 \left( \frac{\sin 2x}{2x} \right)^3
\end{align*}

Hence:
\begin{align*}
\lim_{x \rightarrow 0} \frac{\sin^3 2x}{x^3} &= \frac{1}{8} \left( \frac{\sin 2x}{2x} \right)^3 \\
&= 8 (1)^3 \\
&= 8
\end{align*}

\newpage

\subsection{(f)}
\label{sec:org059dba0}

\begin{align*}
\frac{\sqrt{5x^2 + 3}}{-2x + 5} &= \frac{\sqrt{x^2 \left(5 + \frac{3}{x^2} \right)}}{5 - 2x} \\
&= \frac{\sqrt{x^2} \sqrt{5 + \frac{3}{x^2}}}{5 - 2x} \\
&= \frac{|x| \sqrt{5 + \frac{3}{x^2}}}{5 - 2x} \\
&= \frac{|x| \sqrt{5 + \frac{3}{x^2}}}{x \left(\frac{5}{x} - 2 \right)}
\end{align*}

Hence:
\[\lim_{x \rightarrow -\infty} \frac{\sqrt{5x^2 + 3}}{-2x + 5} = \frac{|x| \sqrt{5 + \frac{3}{x^2}}}{x \left(\frac{5}{x} - 2 \right)}\]
\\[0pt]

Since \(x \rightarrow -\infty\), \(|x| = -x\), \(\frac{3}{x^2} \rightarrow 0\) and \(\frac{5}{x} \rightarrow 0\):
\begin{align*}
\lim_{x \rightarrow -\infty} \frac{|x| \sqrt{5 + \frac{3}{x^2}}}{x \left( \frac{5}{x} - 2 \right)} &= \lim_{x \rightarrow -\infty} \frac{-x \sqrt{5 + \frac{3}{x^2}}}{x \left(\frac{5}{x} - 2 \right)} \\
&= \lim_{x \rightarrow -\infty} \frac{-\sqrt{5 + \frac{3}{x^2}}}{\left(\frac{5}{x} - 2 \right)} \\
&= \frac{-\sqrt{5 + 0}}{0 - 2} \\
&= \frac{-\sqrt{5}}{-2} \\
&= \frac{\sqrt{5}}{2}
\end{align*}

\subsection{(g)}
\label{sec:org2b2e157}

\begin{align*}
\sqrt{x^4 + 6x^2} - x^2 &= (\sqrt{x^4 + 6x^2} - x^2) \left(\frac{\sqrt{x^4 + 6x^2} + x^2}{\sqrt{x^4 + 6x^2} + x^2} \right) \\
&= \frac{x^4 + 6x^2 - x^4}{\sqrt{x^4 + 6x^2} + x^2} \\
&= \frac{6x^2}{\sqrt{x^4 \left( 1 + \frac{6}{x^2}\right)} + x^2} \\
&= \frac{6x^2}{\sqrt{x^4} \sqrt{1 + \frac{6}{x^2}} + x^2} \\
&= \frac{6x^2}{|x^2| \sqrt{1 + \frac{6}{x^2}} + x^2} \\
&= \frac{6x^2}{x^2 \sqrt{1 + \frac{6}{x^2}} + x^2} \quad \because \quad x^2 > 0 \\
&= \frac{6x^2}{x^2(\sqrt{1 + \frac{6}{x^2}} + 1)} \\
&= \frac{6}{1 + \sqrt{1 + \frac{6}{x^2}}}
\end{align*}

Hence:
\[\lim_{x \rightarrow \infty} \sqrt{x^4 + 6x^2} - x^2 = \lim_{x \rightarrow \infty} \frac{6}{1 + \sqrt{1 + \frac{6}{x^2}}}\]

Since \(\frac{6}{x^2} \rightarrow 0\) as \(x \rightarrow \infty\):
\begin{align*}
\lim_{x \rightarrow \infty} \frac{6}{1 + \sqrt{1 + \frac{6}{x^2}}} &= \frac{6}{1 + \sqrt{1 + 0}} \\
&= \frac{6}{2} \\
&= 3
\end{align*}


\section{Question 2}
\label{sec:orgf72e0a1}

Using the definition of a limit, which is for every \(\varepsilon > 0\), there exists a \(\delta > 0\) such that:

\[0 < |x - a| < \delta, \ x \in A \ \Rightarrow \ |f(x) - L| < \varepsilon\]
\\[0pt]

For \(\varepsilon > 0\), \(x \notin \mathbb{Q}\), \(f(x) = 0\), hence:
\[|0 - 0| = 0 < \varepsilon\]

Thus, the limit for \(f(x)\) exists when \(x \notin \mathbb{Q}\).
\\[0pt]

For \(\varepsilon > 0\), \(x \in \mathbb{Q}\):
\[0 < |x - 0| < \delta\]
\[|x| < \delta\]
\[f(|x|) < \varepsilon\]
\[x < \varepsilon\]

Hence, let \(\delta = \varepsilon\) and we have:
\[0 < |x| < \delta \ \Rightarrow \ |f(x)| < \delta = \varepsilon\]

Thus, \(\lim_{x \rightarrow 0} f(x)\) exists.
\\[0pt]

Guessing the limit of \(f(x)\) to be 0 when \(x \rightarrow 0\):
\[\lim_{x \rightarrow 0} f(x) = 0\]

Proving the limit of \(f(x)\) is 0 when \(x \rightarrow 0\) using the squeeze theorem:
\[\lim_{x \rightarrow 0} f(x) = 0 \quad \Leftrightarrow \quad \lim_{x \rightarrow 0}|f(x) - 0| = 0\]
\[\lim_{x \rightarrow 0} |f(x)| = 0\]

Hence:
\[\lim_{x \rightarrow 0} f(x) = 0\]

\section{Question 3}
\label{sec:orge75b8e7}

\subsection{(a)}
\label{sec:orgafb408d}

To know if Master Yoda can complete all of his tasks on time, we need to take the sum to infinity of the series \(\frac{1}{2}, \frac{1}{4}, \frac{1}{8}, \ldots, \frac{1}{2^n}\):
\begin{align*}
\sum_{k=1}^{\infty} \frac{1}{2^k} &= \frac{\frac{1}{2}}{1 - \frac{1}{2}} \\
&= \frac{\frac{1}{2}}{\frac{1}{2}} \\
&= 1
\end{align*}

Since 2 is a finite number, Master Yoda will be able to complete all of his tasks in finite time.

\newpage

\subsection{(b)}
\label{sec:orga8e23cd}

Taking the sum to \(n\) of the series \(\frac{1}{2}, \frac{1}{5}, \frac{1}{10}, \ldots, \frac{1}{n^2 + n}\):
\begin{align*}
\sum_{k=1}^{n} \frac{1}{k^2 + k} &= \sum_{k=1}^{n} \left(\frac{1}{k} - \frac{1}{k + 1} \right) \\
&= \frac{1}{1} - \frac{1}{2} \\
&+ \frac{1}{2} - \frac{1}{3} \\
&+ \frac{1}{3} - \frac{1}{4} \\
&+ \ldots \\
&+ \frac{1}{n - 2} - \frac{1}{n - 1} \\
&+ \frac{1}{n - 1} - \frac{1}{n} \\
&+ \frac{1}{n} - \frac{1}{n + 1} \\
&= 1 - \frac{1}{n + 1}
\end{align*}

When \(x \rightarrow \infty\), \(\frac{1}{n + 1} \rightarrow 0\) and hence, the sum to infinity of the above series is:
\begin{align*}
\sum_{k=1}^{\infty} \frac{1}{k^2 + k} &= 1 - 0 \\
&= 1
\end{align*}

Since 1 is a finite number, Master Yoda will be able to complete all of his tasks in finite time.

\newpage

\section{Question 4}
\label{sec:orgbe79457}

\subsection{(a)}
\label{sec:org7f71258}

\(\indent\) Squaring \(|x + y|\):
\begin{align*}
|x + y|^2 &= (x + y)^2 \\
&= x^2 + 2xy + y^2
\end{align*}

Squaring \(|x| + |y|\)
\begin{align*}
(|x| + |y|)^2 &= |x|^2 + 2|x||y| + |y|^2 \\
&= x^2 + 2|x||y| + y^2 \quad \because \ |x|^2 = x^2 \text{ and } |y|^2 = y^2
\end{align*}

Since \(|x||y| = xy\) when \(x, y > 0\) or \(x, y < 0\) and \(|x||y| > xy\) when \(x < 0, y > 0\) and \(x > 0, y < 0\), \(|x||y| \ge xy\). This means \(|x + y|^2 \le (|x| + |y|)^2\).
\\[0pt]

Since \(|x + y|^2 \le (|x| + |y|)^2\), \(|x + y| \le |x| + |y|\) (\textbf{Proven}).

\subsection{(b)}
\label{sec:org306ca2b}

\(\indent\) Squaring \(||x| - |y||^2\):
\begin{align*}
||x| - |y||^2 &= (|x| - |y|)^2 \\
&= |x|^2 - 2|x||y| + |y|^2 \\
&= x^2 - 2|x||y| + y^2 \quad \because \ |x|^2 = x^2 \text{ and } |y|^2 = y^2
\end{align*}

Squaring \(|x - y|^2\):
\begin{align*}
|x - y|^2 &= (x - y)^2 \\
&= x^2 - 2xy + y^2
\end{align*}

Since \(|x||y| = xy\) when \(x, y > 0\) or \(x, y < 0\) and \(|x||y| > xy\) when \(x < 0, y > 0\) and \(x > 0, y < 0\), \(|x||y| \ge xy\). This means \(||x| - |y||^2 \le |x - y|^2\).
\\[0pt]

Since \(||x| - |y||^2 \le |x - y|^2\), \(||x| - |y|| \le |x - y|\) (\textbf{Proven}).
\end{document}